Report/SpectrumAPIFrameWorkV3/SpectrumAPIFrameWork/Result/11-Oct-2018/11-Oct-2018_12-56-53/Logs.log

11-10-2018 12:56:53 INFO [driverTest]: Starting execution at +:11-Oct-2018 12:56:53
11-10-2018 12:56:54 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:54 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:54 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_001 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:56:54 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:54 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:54 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Add xmlns="http://tempuri.org/">      <intA>3</intA>      <intB>3</intB>    </Add>  </soap:Body></soap:Envelope>
11-10-2018 12:56:57 INFO [driverTest]: Response Code  :200
11-10-2018 12:56:57 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Thu, 11 Oct 2018 07:26:50 GMT
Content-Length=297
11-10-2018 12:56:57 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AddResponse xmlns="http://tempuri.org/"><AddResult>6</AddResult></AddResponse></soap:Body></soap:Envelope>
11-10-2018 12:56:57 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:56:57 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:57 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:57 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_002 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:56:57 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:57 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:57 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Divide xmlns="http://tempuri.org/">      <intA>6</intA>      <intB>3</intB>    </Divide>  </soap:Body></soap:Envelope>
11-10-2018 12:56:58 INFO [driverTest]: Response Code  :200
11-10-2018 12:56:58 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Thu, 11 Oct 2018 07:26:51 GMT
Content-Length=300
11-10-2018 12:56:58 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><DivideResponse xmlns="http://tempuri.org/"><DivideResult>2</DivideResult></DivideResponse></soap:Body></soap:Envelope>
11-10-2018 12:56:58 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:56:58 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:58 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:58 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_003 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:56:58 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:58 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:58 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Multiply xmlns="http://tempuri.org/">      <intA>3</intA>      <intB>2</intB>    </Multiply>  </soap:Body></soap:Envelope>
11-10-2018 12:56:58 INFO [driverTest]: Response Code  :200
11-10-2018 12:56:58 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Thu, 11 Oct 2018 07:26:51 GMT
Content-Length=302
11-10-2018 12:56:58 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><MultiplyResponse xmlns="http://tempuri.org/"><MultiplyResult>6</MultiplyResult></MultiplyResponse></soap:Body></soap:Envelope>
11-10-2018 12:56:59 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_004 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Subtract xmlns="http://tempuri.org/">      <intA>6</intA>      <intB>3</intB>    </Subtract>  </soap:Body></soap:Envelope>
11-10-2018 12:56:59 INFO [driverTest]: Response Code  :200
11-10-2018 12:56:59 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Thu, 11 Oct 2018 07:26:52 GMT
Content-Length=302
11-10-2018 12:56:59 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SubtractResponse xmlns="http://tempuri.org/"><SubtractResult>3</SubtractResult></SubtractResponse></soap:Body></soap:Envelope>
11-10-2018 12:56:59 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_005 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:56:59 INFO [driverTest]: request Fired +:<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:blz="http://thomas-bayer.com/blz/">   <soapenv:Header/>   <soapenv:Body>      <blz:getBank>         <blz:blz>10060198</blz:blz>      </blz:getBank>   </soapenv:Body></soapenv:Envelope>
11-10-2018 12:57:00 INFO [driverTest]: Response Code  :200
11-10-2018 12:57:00 INFO [driverTest]: Response Header  :Server=Apache-Coyote/1.1
Content-Type=text/xml;charset=ISO-8859-1
Date=Thu, 11 Oct 2018 07:27:08 GMT
Content-Length=400
11-10-2018 12:57:00 INFO [driverTest]: Response   :<?xml version='1.0' encoding='ISO-8859-1'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns1:getBankResponse xmlns:ns1="http://thomas-bayer.com/blz/"><ns1:details><ns1:bezeichnung>Pax-Bank</ns1:bezeichnung><ns1:bic>GENODED1PA6</ns1:bic><ns1:ort>Berlin</ns1:ort><ns1:plz>14005</ns1:plz></ns1:details></ns1:getBankResponse></soapenv:Body></soapenv:Envelope>
11-10-2018 12:57:00 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:57:00 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:00 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:00 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_006 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:57:00 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:00 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:00 INFO [driverTest]: request Fired +:{    "email": "peter@klaven",    "password": "cityslicka"}
11-10-2018 12:57:01 INFO [driverTest]: Response Code  :200
11-10-2018 12:57:01 INFO [driverTest]: Response Header  :Date=Thu, 11 Oct 2018 07:26:54 GMT
Content-Type=application/json; charset=utf-8
Content-Length=28
Connection=keep-alive
Set-Cookie=__cfduid=dde20dec2800121c82d10ff85bbc0ba0c1539242814; expires=Fri, 11-Oct-19 07:26:54 GMT; path=/; domain=.reqres.in; HttpOnly
X-Powered-By=Express
Access-Control-Allow-Origin=*
ETag=W/"1c-Qhb23J5gzWLVsuoGOIKOSkfy7a0"
Expect-CT=max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
Server=cloudflare
CF-RAY=467f99e54effaa9e-SIN
11-10-2018 12:57:01 INFO [driverTest]: Response   :{"token":"QpwL5tke4Pnpja7X"}
11-10-2018 12:57:01 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:57:01 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:01 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:01 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_007 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:57:01 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:01 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:01 INFO [driverTest]: request Fired +:{    "name": "Arun",    "job": "TeamLead"}
11-10-2018 12:57:02 INFO [driverTest]: Response Code  :201
11-10-2018 12:57:02 INFO [driverTest]: Response Header  :Date=Thu, 11 Oct 2018 07:26:55 GMT
Content-Type=application/json; charset=utf-8
Content-Length=82
Connection=keep-alive
Set-Cookie=__cfduid=d77ffec5584449b881744fc8161edda671539242815; expires=Fri, 11-Oct-19 07:26:55 GMT; path=/; domain=.reqres.in; HttpOnly
X-Powered-By=Express
Access-Control-Allow-Origin=*
ETag=W/"52-6ax32Ra+SO0FBW7yzaP+bWjt5wY"
Expect-CT=max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
Server=cloudflare
CF-RAY=467f99ecfc3ca9ea-SIN
11-10-2018 12:57:02 INFO [driverTest]: Response   :{"name":"Arun","job":"TeamLead","id":"235","createdAt":"2018-10-11T07:29:27.936Z"}
11-10-2018 12:57:02 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:57:02 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:02 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:02 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_008 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:57:02 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:02 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:02 INFO [driverTest]: request Fired +:{    "name": "",    "job": ""}
11-10-2018 12:57:03 INFO [driverTest]: Response Code  :200
11-10-2018 12:57:03 INFO [driverTest]: Response Header  :Date=Thu, 11 Oct 2018 07:26:56 GMT
Content-Type=application/json; charset=utf-8
Transfer-Encoding=chunked
Connection=keep-alive
Set-Cookie=__cfduid=dfcb41d36445bea1b0118096a0f45a1161539242816; expires=Fri, 11-Oct-19 07:26:56 GMT; path=/; domain=.reqres.in; HttpOnly
X-Powered-By=Express
Access-Control-Allow-Origin=*
ETag=W/"1bb-wM9a6JWbwt3JpLNfwoQwxnqaC3Y"
Expect-CT=max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
Server=cloudflare
CF-RAY=467f99f1eddcaa08-SIN
Content-Encoding=gzip
11-10-2018 12:57:03 INFO [driverTest]: Response   :{"page":2,"per_page":3,"total":12,"total_pages":4,"data":[{"id":4,"first_name":"Eve","last_name":"Holt","avatar":"https://s3.amazonaws.com/uifaces/faces/twitter/marcoramires/128.jpg"},{"id":5,"first_name":"Charles","last_name":"Morris","avatar":"https://s3.amazonaws.com/uifaces/faces/twitter/stephenmoon/128.jpg"},{"id":6,"first_name":"Tracey","last_name":"Ramos","avatar":"https://s3.amazonaws.com/uifaces/faces/twitter/bigmancho/128.jpg"}]}
11-10-2018 12:57:03 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
11-10-2018 12:57:03 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:03 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:03 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_009 $$$$$$$$$$$$$$$$$$$$$$$$$
11-10-2018 12:57:03 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:03 INFO [driverTest]: ****************************************************************************************
11-10-2018 12:57:03 INFO [driverTest]: request Fired +:<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.dataaccess.com/webservicesserver/">   <soapenv:Header/>   <soapenv:Body>      <web:NumberToDollars>         <web:dNum>200</web:dNum>      </web:NumberToDollars>   </soapenv:Body></soapenv:Envelope>
11-10-2018 12:57:03 INFO [driverTest]: Response Code  :200
11-10-2018 12:57:03 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/8.0
Web-Service=DataFlex 18.1
Access-Control-Allow-Origin=http://www.dataaccess.com
Access-Control-Allow-Methods=GET, POST
Access-Control-Allow-Headers=content-type
Access-Control-Allow-Credentials=true
Strict-Transport-Security=max-age=31536000
Date=Thu, 11 Oct 2018 07:26:29 GMT
Content-Length=316
11-10-2018 12:57:03 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:NumberToDollarsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
      <m:NumberToDollarsResult>two hundred dollars</m:NumberToDollarsResult>
    </m:NumberToDollarsResponse>
  </soap:Body>
</soap:Envelope>
11-10-2018 12:57:03 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
